app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "This micropost really ties the room together"], ["user_id", 762146111], ["created_at", 2017-03-12 22:04:08 UTC], ["updated_at", 2017-03-12 22:04:08 UTC]]

  def destroy
    @micropost.destroy
---
DELETE FROM "microposts" WHERE "microposts"."id" = $1  [["id", 1033843181]]